In [1]:
!pip install pandas openpyxl

Requirement already satisfied: pandas in c:\users\ghaza\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: openpyxl in c:\users\ghaza\anaconda3\lib\site-packages (3.1.5)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ghaza\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ghaza\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ghaza\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ghaza\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: et-xmlfile in c:\users\ghaza\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: six>=1.5 in c:\users\ghaza\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\ghaza\anaconda3\lib\site-packages (2.0.2)

In [3]:
import os
os.listdir(r"C:\Users\ghaza\Desktop\Ironhack\week_2\Mini_Project")

['.ipynb_checkpoints',
 'GSAF5.xls',
 'Notes_for_mini_project.py',
 'Shark_Attacks_Ghazal.ipynb']

In [4]:
import pandas as pd
df = pd.read_excel("GSAF5.xls")
df

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Species,Source,pdf,href formula,href,Case Number,Case Number.1,original order,Unnamed: 21,Unnamed: 22
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,...,Nurse shark,Kevin McMurray Trackingsharks.com Andy Currie,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,11th October,2025.0,Unprovoked,Australia,Queensland,Cook Esplanade Thursday Island,Fishing/swimming,Samuel Nai,M,14,...,Tiger or Bull shark,Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,...,Bronze whaler?,Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,29th September,2025.0,Unprovoked,USA,Off California,Catalina Island,Swimming,Christopher Murray,M,54,...,unknown 1.2m shark,Todd Smith: Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,27th September,2025.0,Provoked,Costa Rica,NaN,Cocos Islands,Diving-Tagging sharks,Dr. Mauricio Hoyos,M,48,...,Tiger shark 4m,Todd Smith: Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7045,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,...,NaN,"H. Taunton; N. Bartlett, p. 234",ND-0005-RoebuckBay.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0005,ND.0005,6.0,NaN,NaN
7046,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,...,NaN,"H. Taunton; N. Bartlett, pp. 233-234",ND-0004-Ahmun.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0004,ND.0004,5.0,NaN,NaN
7047,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,Coast Guard personnel,M,NaN,...,NaN,"F. Schwartz, p.23; C. Creswell, GSAF",ND-0003-Ocracoke_1900-1905.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0003,ND.0003,4.0,NaN,NaN
7048,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ºN, 79ºW",NaN,Jules Patterson,M,NaN,...,NaN,"The Sun, 10/20/1938",ND-0002-JulesPatterson.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0002,ND.0002,3.0,NaN,NaN
7049,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,...,NaN,S.W. Baker,ND-0001-Ceylon.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0001,ND.0001,2.0,NaN,NaN

#Cleaning column "Sex":

In [5]:
df.columns

Index(['Date', 'Year', 'Type', 'Country', 'State', 'Location', 'Activity',
       'Name', 'Sex', 'Age', 'Injury', 'Fatal Y/N', 'Time', 'Species ',
       'Source', 'pdf', 'href formula', 'href', 'Case Number', 'Case Number.1',
       'original order', 'Unnamed: 21', 'Unnamed: 22'],
      dtype='object')

In [6]:
df.shape

(7050, 23)

In [7]:
df.dtypes

Date               object
Year              float64
Type               object
Country            object
State              object
Location           object
Activity           object
Name               object
Sex                object
Age                object
Injury             object
Fatal Y/N          object
Time               object
Species            object
Source             object
pdf                object
href formula       object
href               object
Case Number        object
Case Number.1      object
original order    float64
Unnamed: 21        object
Unnamed: 22        object
dtype: object

In [8]:
df.info

<bound method DataFrame.info of                 Date    Year        Type             Country  \
0       14th October  2025.0  Unprovoked            Columbia
1       11th October  2025.0  Unprovoked           Australia
2        7th October  2025.0  Unprovoked           Australia
3     29th September  2025.0  Unprovoked                 USA
4     27th September  2025.0    Provoked          Costa Rica
...              ...     ...         ...                 ...
7045     Before 1903     0.0  Unprovoked           AUSTRALIA
7046     Before 1903     0.0  Unprovoked           AUSTRALIA
7047       1900-1905     0.0  Unprovoked                 USA
7048       1883-1889     0.0  Unprovoked              PANAMA
7049       1845-1853     0.0  Unprovoked  CEYLON (SRI LANKA)

                      State                             Location  \
0      Bolivar, del Isolate                    Catagena Province
1                Queensland       Cook Esplanade Thursday Island
2           South Australia                      Kangaroo Island
3            Off California                      Catalina Island
4                       NaN                        Cocos Islands
...                     ...                                  ...
7045      Western Australia                          Roebuck Bay
7046      Western Australia                                  NaN
7047         North Carolina                       Ocracoke Inlet
7048                    NaN                 Panama Bay 8ºN, 79ºW
7049       Eastern Province  Below the English fort, Trincomalee

                   Activity                   Name Sex  Age  ...  \
0      Swimming with sharks             Male child   M   14  ...
1          Fishing/swimming             Samuel Nai   M   14  ...
2                   Surfing           Lee Berryman   M  50+  ...
3                  Swimming     Christopher Murray   M   54  ...
4     Diving-Tagging sharks     Dr. Mauricio Hoyos   M   48  ...
...                     ...                    ...  ..  ...  ...
7045                 Diving                   male   M  NaN  ...
7046           Pearl diving                  Ahmun   M  NaN  ...
7047               Swimming  Coast Guard personnel   M  NaN  ...
7048                    NaN        Jules Patterson   M  NaN  ...
7049               Swimming                   male   M   15  ...

                 Species                                          Source  \
0            Nurse shark   Kevin McMurray Trackingsharks.com Andy Currie
1     Tiger or Bull shark              Kevin McMurray Trackingsharks.com
2          Bronze whaler?              Kevin McMurray Trackingsharks.com
3      unknown 1.2m shark  Todd Smith: Kevin McMurray Trackingsharks.com
4          Tiger shark 4m  Todd Smith: Kevin McMurray Trackingsharks.com
...                   ...                                            ...
7045                  NaN               H. Taunton; N. Bartlett,  p. 234
7046                  NaN          H. Taunton; N. Bartlett,  pp. 233-234
7047                  NaN           F. Schwartz, p.23; C. Creswell, GSAF
7048                  NaN                            The Sun, 10/20/1938
7049                  NaN                                     S.W. Baker

                                 pdf  \
0                                NaN
1                                NaN
2                                NaN
3                                NaN
4                                NaN
...                              ...
7045          ND-0005-RoebuckBay.pdf
7046               ND-0004-Ahmun.pdf
7047  ND-0003-Ocracoke_1900-1905.pdf
7048      ND-0002-JulesPatterson.pdf
7049              ND-0001-Ceylon.pdf

                                           href formula  \
0                                                   NaN
1                                                   NaN
2                                                   NaN
3                                                   NaN
4                                                   NaN
...                                                 ...
7045  http://sharkattackfile.net/spreadsheets/pdf_di...
7046  http://sharkattackfile.net/spreadsheets/pdf_di...
7047  http://sharkattackfile.net/spreadsheets/pdf_di...
7048  http://sharkattackfile.net/spreadsheets/pdf_di...
7049  http://sharkattackfile.net/spreadsheets/pdf_di...

                                                   href Case Number  \
0                                                   NaN         NaN
1                                                   NaN         NaN
2                                                   NaN         NaN
3                                                   NaN         NaN
4                                                   NaN         NaN
...                                                 ...         ...
7045  http://sharkattackfile.net/spreadsheets/pdf_di...     ND.0005
7046  http://sharkattackfile.net/spreadsheets/pdf_di...     ND.0004
7047  http://sharkattackfile.net/spreadsheets/pdf_di...     ND.0003
7048  http://sharkattackfile.net/spreadsheets/pdf_di...     ND.0002
7049  http://sharkattackfile.net/spreadsheets/pdf_di...     ND.0001

     Case Number.1 original order Unnamed: 21 Unnamed: 22
0              NaN            NaN         NaN         NaN
1              NaN            NaN         NaN         NaN
2              NaN            NaN         NaN         NaN
3              NaN            NaN         NaN         NaN
4              NaN            NaN         NaN         NaN
...            ...            ...         ...         ...
7045       ND.0005            6.0         NaN         NaN
7046       ND.0004            5.0         NaN         NaN
7047       ND.0003            4.0         NaN         NaN
7048       ND.0002            3.0         NaN         NaN
7049       ND.0001            2.0         NaN         NaN

[7050 rows x 23 columns]>

In [9]:
df["Sex"].head(20)

0      M
1      M
2      M
3      M
4      M
5      M
6      M
7      F
8      M
9      M
10     M
11     M
12     F
13     M
14     M
15    F
16     M
17     M
18     M
19     M
Name: Sex, dtype: object

In [10]:
df["Sex"].dtype

dtype('O')

In [11]:
#To see how many different values there are in column "Sex"
df['Sex'].nunique()

10

In [12]:
#To see What are the different values in column "Sex"
df['Sex'].unique()

array(['M', 'F', 'F ', 'M ', nan, ' M', 'm', 'lli', 'M x 2', 'N', '.'],
      dtype=object)

In [13]:
df["Sex"].isnull().sum()

np.int64(579)

In [14]:
#Tp see how often each value appears
df["Sex"].value_counts(dropna=False)

Sex
M        5654
F         805
NaN       579
M           3
F           2
N           2
 M          1
m           1
lli         1
M x 2       1
.           1
Name: count, dtype: int64

In [16]:
#standardizing formatting
#to refine the data frame --> convert everything to string/ lowercasing everything /removing spaces at the beginning and end
df["Sex"] = df["Sex"].astype(str).str.lower().str.strip()

In [17]:
#to fill in anew value m/f with a proper name using map
df["Sex"] = df["Sex"].map({
    "m": "male",
    "f": "female"
}).fillna(df["Sex"])

In [18]:
#to replace meaningless values with Na as a missing value
df["Sex"] = df["Sex"].replace(
    ["n", "m x 2", ".", "lli", "", "nan"],
    pd.NA
)

In [19]:
df["Sex"].value_counts(dropna=False)

Sex
male      5659
female     807
<NA>       584
Name: count, dtype: int64

#Cleaning Column "Age"

In [20]:
#General info about the column

In [21]:
df["Age"].dtype

dtype('O')

In [22]:
df["Age"].isnull().sum()

np.int64(2994)

In [23]:
df["Age"].nunique()

251

In [24]:
df["Age"].unique()

array(['14', '50+', '54', '48', '57', '8', '?', '63', '9', '39', '19',
       '7', '85', '69', '18', '66', '21', '40', '37', '16', '20', '12',
       '42', '26', '45', '30', '30+', '56', '40+', '29', 35, 58, 29, 24,
       20, 55, 17, 12, 37, 36, 23, 40, 28, 69, 48, '60+', 57, 45, 61, 27,
       38, 16, 68, 33, 30, 15, 41, 14, 43, 26, 'Middle age', 18, 21, 49,
       25, 46, 19, 65, 64, '13', nan, '11', '46', '32', '10', '64', '62',
       '22', '15', '52', '44', '47', '55', '59', '50', '34', '38', '30s',
       '20/30', '35', '65', '20s', '77', '60', '49', '!2', '24', '73',
       '25', '50s', '58', '67', '17', '6', '41', '53', '68', '43', '51',
       '31', 39, 51, 10, 13, 60, '40s', 62, 'teen', 8, 22, 32, 56, 'Teen',
       42, 50, 'M', 9, 31, 11, 34, '!6', '!!', 47, 7, 71, 59, 53, 54, 75,
       '45 and 15', 73, 52, 70, 4, 63, 44, '28 & 22', '22, 57, 31', '60s',
       "20's", 67, 74, '9 & 60', 'a minor', 6, 3, 82, '40?', 66, 72, '23',
       '36', '71', '70', '18 months', '28', '33', '61', '74', '27', '3',
       '28 & 26', '5', '86', '18 or 20', '12 or 13', '46 & 34',
       '28, 23 & 30', 'Teens', 77, '36 & 26', '8 or 10', 84, '\xa0 ', ' ',
       '30 or 36', '6½', '21 & ?', '33 or 37', 'mid-30s', '23 & 20', 5,
       ' 30', '7      &    31', ' 28', '20?', "60's", '32 & 30',
       '16 to 18', '87', 'Elderly', 'mid-20s', 'Ca. 33', '74 ', '45 ',
       '21 or 26', '20 ', '>50', '18 to 22', 'adult', '9 & 12', '? & 19',
       '9 months', '25 to 35', '23 & 26', 1, '(adult)', '33 & 37',
       '25 or 28', '37, 67, 35, 27,  ? & 27', '21, 34,24 & 35', '30 & 32',
       '50 & 30', '17 & 35', 'X', '"middle-age"', '13 or 18', '34 & 19',
       '33 & 26', '2 to 3 months', '4', 'MAKE LINE GREEN', ' 43', '81',
       '"young"', '7 or 8', 78, '17 & 16', 'F', 'Both 11', '9 or 10',
       'young', '36 & 23', '  ', '78', 'A.M.', '?    &   14', '10 or 12',
       '31 or 33', '2½', '1', '13 or 14'], dtype=object)

In [25]:
df["Age"].value_counts(dropna=False)

Age
NaN         2994
16            92
19            90
17            89
17            85
            ...
10 or 12       1
31 or 33       1
2½             1
1              1
13 or 14       1
Name: count, Length: 252, dtype: int64

In [26]:
#made a backup of the original column#
df["Age_raw"] = df["Age"]

In [27]:
#to refine the data frame --> convert everything to string/ lowercasing everything /removing spaces at the beginning and end
df["Age"] = df["Age"].astype(str).str.lower().str.strip()

In [28]:
#This checks weather the value in the Age column and contain a digit (0–9)?” and look for no digit values
no_digits = ~df["Age"].str.contains(r"\d", na=False)
df.loc[no_digits, "Age"].unique()

array(['?', 'middle age', 'nan', 'teen', 'm', '!!', 'a minor', 'teens',
       '', 'elderly', 'adult', '(adult)', 'x', '"middle-age"',
       'make line green', '"young"', 'f', 'young', 'a.m.'], dtype=object)

In [29]:
# Fix duplicates using replace
df["Age"] = df["Age"].replace({
    "(adult)": "adult",          
    '"young"': "young",          
    '"middle-age"': "middle age",
    "teens": "teen", 
})

In [30]:
# We used the pandas .isin() method to find all junk age values (like "?", "m", "!!", "x", etc.)
#  and replaced them with pd.NA, so the Age column contains only meaningful information. -->  removed junk values
junk_values = ["?", "m", "!!", "", "x", "make line green", "f", "a.m."]

df.loc[df["Age"].isin(junk_values), "Age"] = pd.NA

In [31]:
# Extract the first number inside each Age value
df["Age_num"] = df["Age"].str.extract(r"(\d+)")

In [32]:
# Convert extracted strings into real numbers #float/integer
df["Age_num"] = pd.to_numeric(df["Age_num"], errors="coerce") 
# errors="coerce" means “If something cannot be converted (like a word), turn it into NaN.”

In [33]:
#check: 
df[["Age", "Age_num"]].head(20)

     Age  Age_num
0     14     14.0
1     14     14.0
2    50+     50.0
3     54     54.0
4     48     48.0
5     57     57.0
6      8      8.0
7      8      8.0
8   <NA>      NaN
9     63     63.0
10  <NA>      NaN
11     9      9.0
12    39     39.0
13    19     19.0
14     7      7.0
15    85     85.0
16  <NA>      NaN
17    69     69.0
18    18     18.0
19    66     66.0

In [34]:
# to give the emaningful age groups a numerical age
age_map = {
    "a minor": 1,
    "teen": 15,
    "young": 20,
    "adult": 30,
    "middle age": 45,
    "elderly": 70
}

df["Age_num"] = df["Age_num"].fillna(df["Age"].map(age_map))

In [35]:
#to check:
df.loc[df["Age"].isin(age_map.keys()), ["Age", "Age_num"]].head(20)

             Age  Age_num
79    middle age     45.0
275         teen     15.0
288         teen     15.0
509         teen     15.0
692      a minor      1.0
899         teen     15.0
1014        teen     15.0
1245        teen     15.0
1372        teen     15.0
1702        teen     15.0
2022        teen     15.0
2050        teen     15.0
2240        teen     15.0
2310        teen     15.0
2378        teen     15.0
3604     elderly     70.0
4169       adult     30.0
4375        teen     15.0
4534       adult     30.0
4796  middle age     45.0

In [41]:
import pandas as pd
import numpy as np

conditions = [
    df["Age_num"] < 13,                     # a minor
    df["Age_num"].between(13, 19, inclusive="both"),  # teen
    df["Age_num"].between(20, 29, inclusive="both"),  # young
    df["Age_num"].between(30, 39, inclusive="both"),  # adult
    df["Age_num"].between(40, 64, inclusive="both"),  # middle age
    df["Age_num"] >= 65                     # elderly
]

choices = ["a minor", "teen", "young", "adult", "middle age", "elderly"]

# 1) use a string as default so all outputs are strings
df["age_group"] = np.select(conditions, choices, default="unknown")

# 2) optional: turn "unknown" into proper missing values
df["age_group"] = df["age_group"].replace("unknown", pd.NA)

In [42]:
#Checking for missing or weird age-category values
df["age_group"].value_counts(dropna=False)

age_group
<NA>          3014
young         1126
teen          1046
middle age     780
adult          644
a minor        356
elderly         84
Name: count, dtype: int64

In [43]:
#Inspect rows where age is missing
df[df["age_group"].isnull()][["Age", "Age_num"]].head(20)

      Age  Age_num
8    <NA>      NaN
10   <NA>      NaN
16   <NA>      NaN
25   <NA>      NaN
36   <NA>      NaN
55   <NA>      NaN
60   <NA>      NaN
83   <NA>      NaN
98   <NA>      NaN
100   nan      NaN
104   nan      NaN
124   nan      NaN
125   nan      NaN
130   nan      NaN
137   nan      NaN
140   nan      NaN
141   nan      NaN
142   nan      NaN
150   nan      NaN
151   nan      NaN

In [44]:
df["age_group"].isnull().sum()

np.int64(3014)

In [45]:
df["age_group"].isna().sum()

np.int64(3014)

In [ ]:
#keep them
#remove them with # df = df.dropna(subset=["Age_num"])
#Fill missing ages with "unknown" --> df["Custom_Age_group"] = df["Custom_Age_group"].fillna("unknown")
#Fill Age_num with the median or mean (NOT recommended )

In [46]:
#Inspect extreme or unrealistic ages
df[df["Age_num"] > 120][["Age", "Age_num"]]

Empty DataFrame
Columns: [Age, Age_num]
Index: []

In [47]:
df_clean = df.dropna(subset=["Age_num"])

#checking

In [48]:
df[["Age", "Age_num", "age_group"]].head(20)

     Age  Age_num   age_group
0     14     14.0        teen
1     14     14.0        teen
2    50+     50.0  middle age
3     54     54.0  middle age
4     48     48.0  middle age
5     57     57.0  middle age
6      8      8.0     a minor
7      8      8.0     a minor
8   <NA>      NaN        <NA>
9     63     63.0  middle age
10  <NA>      NaN        <NA>
11     9      9.0     a minor
12    39     39.0       adult
13    19     19.0        teen
14     7      7.0     a minor
15    85     85.0     elderly
16  <NA>      NaN        <NA>
17    69     69.0     elderly
18    18     18.0        teen
19    66     66.0     elderly

In [49]:
#rows that are missing
df["Age_num"].isna().sum()

np.int64(3014)

In [50]:
#unique age group
df["age_group"].unique()

array(['teen', 'middle age', 'a minor', <NA>, 'adult', 'elderly', 'young'],
      dtype=object)

In [51]:
df["age_group"].value_counts(dropna=True)

age_group
young         1126
teen          1046
middle age     780
adult          644
a minor        356
elderly         84
Name: count, dtype: int64

In [52]:
result = (df.groupby("age_group").size() / len(df) * 100).round(2).sort_values(ascending=False)
display(result.astype(str) + "%")

age_group
young         15.97%
teen          14.84%
middle age    11.06%
adult          9.13%
a minor        5.05%
elderly        1.19%
dtype: object